// let i = 0

// while(i<10) {
// i = i + 1
// console.log(i)

// }
// do{
//     i++
//     console.log(i)
// } while(i<5)

// for (let i = 1; i <= 10; i++) {
// 	console.log(`Пройден ${i} круг`)
// }

// ====================ДЗ====================

// Выведите в консоль четные числа
// от 2 до 12, используйте цикл for и условие.
for (let i = 2; i <= 12; i = i + 2) {
	console.log(i)
}

// // // При помощи цикла for выведите в
// // // консоль числа от 10 до 1, в обратном порядке.
for (let i = 10; i >= 1; i = i - 1) {
	console.log(i)
}

// // Перепишите 1 и 2 цикл используя цикл while.

i = 0
while (i <= 10) {
	i = i + 2
	console.log(i)
}

i = 11
while (i >= 2) {
	i = i - 1
	console.log(i)
}
